[
  {
    "id": "1",
    "title": "Instructional Planning",
    "description": "This course highlights how careful thought and planning is essential for an effective teacher. Teachers who dedicate time to planning are more successful in assisting students in achieving course objectives. In this module participants will learn about the various teaching strategies associated with proper course, unit, and daily planning. Participants will acknowledge the importance of educators comprehending the varied backgrounds and requirements of students. This knowledge is utilized by teachers to create and adapt instructional plans. Furthermore, some students may possess unique learning requirements that necessitate modifications to the lesson plan to accommodate their Individualized Education Plans (IEPs).",
    "units": [
      "Introduction to CTE instruction.",
      "Content knowledge and application",
      "Learning reflective classroom practices",
      "Learning the instructional planning process",
      "Knowledge of teacher-student communication and relationship building."
    ]
  },
  {
    "id": "2",
    "title": "Engagement Strategies",
    "description": "This course cultivates a thorough comprehension of actively involving students in intellectually stimulating instruction. In preparing students for college and careers, CTE teachers must utilize effective strategies to develop students' critical thinking, problem-solving, and academic and technical skills. Participants will explore cooperative learning, Webb's Depth of Knowledge, and review how to embed academics and apply technology tools to the CTE classroom. CTE teachers will learn to create high-quality projects aligning with technical and academic standards. Project-based learning is crucial in CTE, and teachers must understand how projects can focus on a unit of study, linking classroom learning to the workplace.",
    "units": [
      "Creating a vision for CTE instruction.",
      "Learn to use cooperative learning in classroom settings.",
      "Learn to integrate instructional technology in the classroom.",
      "Learn the significance of project-based learning."
    ]
  },
  {
    "id": "3",
    "title": "Assessment and Feedback",
    "description": "This course focuses on assessment tools that offer valuable feedback to help teachers effectively gauge student progress, helping beginning teachers use two types of assessment: summative and formative. Both provide ongoing feedback that improves student motivation and learning and measures what they learn. Recording assessment data and grades will also be discussed.",
    "units": [
      "Acquire an understanding of assessments and feedback.",
      "Learn to implement effective grading practices in the classroom.",
      "Learn how to design and use assessment tools.",
      "Learn how to manage and understand assessment data."
    ]
  },
  {
    "id": "4",
    "title": "Classroom Culture",
    "description": "This course covers positive classroom culture and how it pertains to student learning and development, showcasing how the learning environment impacts student learning, behavior, and motivation. Well-defined plans that incorporate strategies to support student motivation, understand their mindset, and establish clear classroom rules and procedures are imperative to academic success. Further, fostering positive connections with families, actively participating in CTE student organizations, and collaborating with advisory committees enhances student achievement. Additionally, this course presents classroom management situations and how teachers must utilize levels of intervention to tackle undesirable conduct.",
    "units": [
      "Learn how to establish and maintain a positive classroom culture.",
      "Learn how to support student success.",
      "Learn how to create a motivating, personalized learning environment.",
      "Learn how to implement classroom interventions."
    ]
  },
  {
    "id": "5",
    "title": "Principles of WV CTE",
    "description": "The central focus of this course is gaining a comprehensive understanding of West Virginia CTE standards, including the imperative need for accountability, prevailing state and federal mandates for CTE, and the crucial role of instructional leadership in a CTE setting. Course instruction will dive further into implementing the Simulated Workplace, a program enabling students to assume responsibility for their technical performance and classroom environment. Participants will learn about work-based learning opportunities available to students and the diverse financing options accessible to advancing CTE.",
    "units": [
      "Learn about CTE accountability.",
      "Learn about CTE initiatives and opportunities for students.",
      "Learn about work-based learning through the Classroom 2 Career program.",
      "Learn more about the Simulated Workplace.",
      "Gain an understanding of CTE policy and financing options for programs."
    ]
  },
  {
    "id": "6",
    "title": "CTE Teacher Mentorship",
    "description": "This course introduces the CTE Teacher Mentoring program, specifically designed to support new CTE teachers in developing confidence in their teaching skills. CTE teachers bring content knowledge of their craft to the classroom but often need additional assistance with the transition to education. Every newly appointed CTE teacher will be assigned a mentor for continuous guidance and induction-style professional development centered around standards-based lesson planning, classroom management, assessments, and student engagement. In conjunction with instructional coaching, mentors can provide newly hired CTE teachers with information regarding West Virginia CTE-specific initiatives and expectations. To be deemed eligible for licensure, it is mandatory for all new CTE teachers to complete the CTE Teacher Mentoring Program.",
    "units": [
      "Learn about proper classroom arrangement.",
      "Learn about classroom equipment and safety protocols.",
      "Access to monthly virtual collaborative sessions.",
      "Learn about program-specific topics (credentials, embedded credits, etc.).",
      "Regular classroom visits.",
      "Access to multiple in-person trainings."
    ]
  }
]